In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [62]:
df1 = DataFrame(np.arange(9).reshape(3,3),index = ['BJ','SH','GZ'], columns = ['a','b','c'])

In [63]:
df1

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [64]:
df1.index

Index(['BJ', 'SH', 'GZ'], dtype='object')

In [65]:
df1.index = Series(['bj','sh','gz'])  #solution 1

In [66]:
df1

    a  b  c
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [11]:
df1.index

Index(['bj', 'sh', 'gz'], dtype='object')

In [12]:
df1.index.map(str.upper)  # map(mapper), mapper is a function

Index(['BJ', 'SH', 'GZ'], dtype='object')

In [16]:
df1.index = df1.index.map(str.upper)  #solution 2

In [17]:
df1

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [22]:
df1.rename(index = str.lower, columns = str.upper)  #solution 3A

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [23]:
df1

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [24]:
df1.rename(index = {'BJ':'beijing'}, columns = {'a':'AA'})  #solution 3B

         AA  b  c
beijing   0  1  2
SH        3  4  5
GZ        6  7  8

In [38]:
lst = [1,2,3,4]
lst_new = ['1','2','3','4']

In [39]:
[str(x) for x in lst ]  #solution 1

['1', '2', '3', '4']

In [47]:
lst_new = list(map(str, lst))  # solution 2  run str function in lst

In [48]:
lst_new

['1', '2', '3', '4']

In [49]:
df1

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [50]:
def test_map(x):
    return x + '_abc'

In [51]:
df1.rename(index = test_map) #run function test_map in df1.index

Index(['BJ_abc', 'SH_abc', 'GZ_abc'], dtype='object')

In [52]:
df1.rename(index = test_map)

        a  b  c
BJ_abc  0  1  2
SH_abc  3  4  5
GZ_abc  6  7  8